app/views/services/new.html.slim

                    = f.fields_for :properties, OpenStruct.new(@service.properties) do |builder|
                      - @service.service_category.fields.sort.each do |field|
---
SELECT "service_categories".* FROM "service_categories"