app/controllers/pages_controller.rb

  def list_user
    @users = User.order(:first_name).page params[:page]
---
SELECT  "users".* FROM "users"  ORDER BY "users"."first_name" ASC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "users"

  def search_user
    if params[:search].present?
      @users = User.search params[:search] , page: params[:page], per_page: 10
    else
      @users = User.order(:first_name).page params[:page]
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1  ORDER BY "users"."first_name" ASC LIMIT 20 OFFSET 0  [["first_name", "lintang"]]
SELECT COUNT(*) FROM "users" WHERE "users"."first_name" = $1  [["first_name", "lintang"]]

  def set_user
    @user = User.find_by(first_name: params[:name], id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 AND "users"."id" = $2 LIMIT 1  [["first_name", "arief"], ["id", 10]]