app/controllers/services_controller.rb

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 9]]
---
  def show
    @product_service = ProductService.new
    @feedback = Feedback.new
    @show_product = @service.product_services
    @service_category = ServiceCategory.find(@service.service_category_id)
    @pending = nil
    if current_user
      @pending = @service.user.pending_invited_by.map(&:id).include? current_user.id

SELECT "service_categories".* FROM "service_categories"
---
  def new
    @service_categories = ServiceCategory.all

INSERT INTO "services" ("service_category_id", "title", "description", "avatar", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @service = current_user.services.new(service_params)
    respond_to do |format|
      if @service.save

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", 13]]
---
    def set_service
      @service = Service.find(params[:id])

SELECT "services".* FROM "services"
SELECT  "services".* FROM "services"  ORDER BY "services"."title" ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "services"
---
    def find_products
      params.reject! {|key,val| key == "controller" || key == "action" || key == "commit"}
      if params.any? { |(key, value)| key == "address_1" || key == "service_category_id" || key == "title" }
        services = Service.all
        services = services.where("title LIKE ?", "%#{params[:title]}%") if params[:title].present?
        services = services.near([params[:latitude], params[:longitude]], params[:dstn], :order => 'distance') if params[:latitude].present?
        if params[:service_category_id] != "0"
          services = services.where(service_category_id: params[:service_category_id]) if params[:service_category_id].present?
        end
        if params[:sv].present?
          if params[:sv] == "2"
            services = services.order("title DESC")
          end
        end
        if params[:sp].present?
          if params[:sp] == "1"
            services = services.order("title DESC")
          elsif params[:sp] == "2"
            services = services.order("title DESC")
          else
            services = services.order("title DESC")
          end
        end
        services.page params[:page]