app/controllers/services_controller.rb

  def index
    @services = Service.order(:title).page params[:page]
    @service_categories = ServiceCategory.order(:name)
---
SELECT "service_categories".* FROM "service_categories"  ORDER BY "service_categories"."name" ASC