app/controllers/statics_controller.rb

SELECT "service_categories".* FROM "service_categories"
---
  def home
    @service_categories = ServiceCategory.all